Конфигурация/Documents/РаспределениеАктивовСтраховыхКомпаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РаспределениеАктивовСтраховыхКомпаний</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтоимостьАктивовСтраховыхКомпаний</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьНедопокрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недопокрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеИсключенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АктивыСтраховойКомпании</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Актив</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.АктивыСтраховыхКомпаний</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсключенИзРаспределений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубъектПрочегоАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКурса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нераспределено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезервыПоСтрахованиюЖизни</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезервыПоСтрахованиюИномуЧемЖизни</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственныеСредстваВРазмереНорматива</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственныеСредстваСверхНорматива</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ДанныеКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/БухПартииЦенныхБумагКупленныеПоРЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>БухПартииЦенныхБумагКупленныеПоРЕПО</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьКупонаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переоценка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупонаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаСНачалаГодаПоложительная</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупонаСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтрокаКорзиныЦенныхБумаг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПогрешностиОкругления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДенежныеСредстваВКредитныхИнструментах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВКредитныхИнструментах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияДополнительныхСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхСведений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/РаспределениеАктивовСтраховыхКомпаний/Ext/ManagerModule.bsl
Функция ПолучитьСтоимостьЦенныхБумагСтраховойКомпании(СчетДоверительногоУправления, Организация, Период) Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ДанныеКалендаря.Дата) КАК ОтчетнаяДата,
	|	&Период КАК Период,
	|	НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет КАК ЕдиныйБУ,
	|	НастройкиУчетаОбщиеСрезПоследних.ВключатьПроцентныеДоходыИКорректировкиВБалансовуюСтоимостьПриПереоценке КАК КорректировкиВСтоимости
	|ПОМЕСТИТЬ _Настройки
	|ИЗ
	|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаОбщиеСрезПоследних
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДанныеКалендаря.Дата <= &Период
	|	И КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет,
	|	НастройкиУчетаОбщиеСрезПоследних.ВключатьПроцентныеДоходыИКорректировкиВБалансовуюСтоимостьПриПереоценке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиЦенныхБумаг.Организация КАК Организация,
	|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ОстаткиЦенныхБумаг.ВидУчета КАК ВидУчета,
	|	ОстаткиЦенныхБумаг.Рынок КАК Рынок,
	|	ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ОстаткиЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	|	ОстаткиЦенныхБумаг.ВалютаНоминала КАК ВалютаНоминала,
	|	СУММА(ОстаткиЦенныхБумаг.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ОстаткиЦенныхБумаг.СтоимостьОстаток) КАК СтоимостьОстаток,
	|	СУММА(ОстаткиЦенныхБумаг.СтоимостьКупонаОстаток) КАК СтоимостьКупонаОстаток,
	|	СУММА(ОстаткиЦенныхБумаг.СтоимостьПокупкиОстаток) КАК СтоимостьПокупкиОстаток,
	|	СУММА(ОстаткиЦенныхБумаг.СтоимостьПокупкиКупонаОстаток) КАК СтоимостьПокупкиКупонаОстаток,
	|	СУММА(ОстаткиЦенныхБумаг.ПереоценкаОстаток) КАК ПереоценкаОстаток,
	|	СУММА(ОстаткиЦенныхБумаг.ПереоценкаКупонаОстаток) КАК ПереоценкаКупонаОстаток,
	|	СУММА(ОстаткиЦенныхБумаг.ДисконтПремияНачисленныйОстаток) КАК ДисконтПремияНачисленныйОстаток,
	|	СУММА(ОстаткиЦенныхБумаг.КорректировкаЭСПОстаток) КАК КорректировкаЭСПОстаток
	|ПОМЕСТИТЬ _ОстаткиЦенныхБумаг
	|ИЗ
	|	(ВЫБРАТЬ
	|		БухПартииЦенныхБумагОстатки.Организация КАК Организация,
	|		БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|		БухПартииЦенныхБумагОстатки.ВидУчета КАК ВидУчета,
	|		БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
	|		БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|		БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	|		ВЫБОР
	|			КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|				ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
	|			КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|				ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
	|			КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	|				ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала
	|			ИНАЧЕ БухПартииЦенныхБумагОстатки.Организация.ВалютаУчета
	|		КОНЕЦ КАК ВалютаНоминала,
	|		БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|		БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
	|		БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупонаОстаток,
	|		БухПартииЦенныхБумагОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупкиОстаток,
	|		БухПартииЦенныхБумагОстатки.СтоимостьПокупкиКупонаОстаток КАК СтоимостьПокупкиКупонаОстаток,
	|		БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
	|		БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупонаОстаток,
	|		БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
	|		БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток
	|	ИЗ
	|		РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|				&КонецДняПериода,
	|				Организация = &Организация
	|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухПартииЦенныхБумагОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Настройки КАК Настройки
	|			ПО (ИСТИНА)
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА Настройки.ЕдиныйБУ = ИСТИНА
	|					ТОГДА БухПартииЦенныхБумагОстатки.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
	|				ИНАЧЕ БухПартииЦенныхБумагОстатки.ВидУчета <> ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Организация,
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СчетДоверительногоУправления,
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ВидУчета,
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Рынок,
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага,
	|		ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО),
	|		ВЫБОР
	|			КОГДА БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|				ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
	|			КОГДА БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|				ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
	|			КОГДА БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	|				ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала
	|			ИНАЧЕ БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Организация.ВалютаУчета
	|		КОНЕЦ,
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.КоличествоОстаток,
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьОстаток,
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьКупонаОстаток,
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьОстаток,
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьКупонаОстаток,
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаОстаток,
	|		БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаКупонаОстаток,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО.Остатки(
	|				&КонецДняПериода,
	|				Организация = &Организация
	|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагКупленныеПоРЕПООстатки) КАК ОстаткиЦенныхБумаг
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления,
	|	ОстаткиЦенныхБумаг.Организация,
	|	ОстаткиЦенныхБумаг.Рынок,
	|	ОстаткиЦенныхБумаг.ЦеннаяБумага,
	|	ОстаткиЦенныхБумаг.УчетныйАктивЕПС,
	|	ОстаткиЦенныхБумаг.ВидУчета,
	|	ОстаткиЦенныхБумаг.ВалютаНоминала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ОстаткиЦенныхБумаг.Период, ДЕНЬ)) КАК ДатаПоследнейОперации,
	|	ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ОстаткиЦенныхБумаг.Организация КАК Организация,
	|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ПОМЕСТИТЬ _ПоследниеОперацииНадЦеннымиБумагами
	|ИЗ
	|	РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Настройки КАК _Настройки
	|		ПО (&Период > ДАТАВРЕМЯ(2016, 12, 31, 0, 0, 0))
	|ГДЕ
	|	ОстаткиЦенныхБумаг.Организация = &Организация
	|	И &ИспользоватьПравила710П = ЛОЖЬ
	|	И ОстаткиЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И ОстаткиЦенныхБумаг.Период МЕЖДУ _Настройки.ОтчетнаяДата И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	|	И ОстаткиЦенныхБумаг.ЦеннаяБумага В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				_ОстаткиЦенныхБумаг.ЦеннаяБумага
	|			ИЗ
	|				_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦенныхБумаг.ЦеннаяБумага,
	|	ОстаткиЦенныхБумаг.Организация,
	|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ОстаткиЦенныхБумаг.Организация КАК Организация,
	|	_ОстаткиЦенныхБумаг.СчетДоверительногоУправления.Родитель КАК СчетДоверительногоУправленияРодитель,
	|	_ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ОстаткиЦенныхБумаг.ВалютаНоминала КАК Валюта,
	|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(МАКСИМУМ(КурсыВалютФиксированнаяДата.Период), ЕСТЬNULL(МАКСИМУМ(КурсыВалютДляПартий.Период), КурсыВалютСрезПоследних.Период)), ДЕНЬ) КАК ДатаКурсаВалют
	|ПОМЕСТИТЬ _ДатыДействующихКурсовВалютДляАктивов
	|ИЗ
	|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Настройки КАК _Настройки
	|		ПО (&Период > ДАТАВРЕМЯ(2016, 12, 31, 0, 0, 0))
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеОперацииНадЦеннымиБумагами КАК _ПоследниеОперацииНадЦеннымиБумагами
	|		ПО (_ПоследниеОперацииНадЦеннымиБумагами.ЦеннаяБумага = _ОстаткиЦенныхБумаг.ЦеннаяБумага)
	|			И (_ПоследниеОперацииНадЦеннымиБумагами.СчетДоверительногоУправления = _ОстаткиЦенныхБумаг.СчетДоверительногоУправления)
	|			И _ОстаткиЦенныхБумаг.Организация = _ПоследниеОперацииНадЦеннымиБумагами.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютДляПартий
	|		ПО (КурсыВалютДляПартий.Период = ЕСТЬNULL(_ПоследниеОперацииНадЦеннымиБумагами.ДатаПоследнейОперации, _Настройки.ОтчетнаяДата))
	|			И (КурсыВалютДляПартий.Валюта = _ОстаткиЦенныхБумаг.ВалютаНоминала)
	|			И (&ИспользоватьПравила710П = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	|		ПО _ОстаткиЦенныхБумаг.ВалютаНоминала = КурсыВалютСрезПоследних.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(ДАТАВРЕМЯ(2022, 2, 18), ) КАК КурсыВалютФиксированнаяДата
	|		ПО _ОстаткиЦенныхБумаг.ВалютаНоминала = КурсыВалютФиксированнаяДата.Валюта
	|			И (ВЫРАЗИТЬ(_ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).КодСчета В (""6/DSK"",""8/DSK"",""11/DSK""))
	|			И (&Период >= ДАТАВРЕМЯ(2022, 2, 28))
	|           И (&Период <= ДАТАВРЕМЯ(2023, 1, 1))
	|СГРУППИРОВАТЬ ПО
	|	_ОстаткиЦенныхБумаг.ВалютаНоминала,
	|	_ОстаткиЦенныхБумаг.ЦеннаяБумага,
	|	_ОстаткиЦенныхБумаг.Организация,
	|	_ОстаткиЦенныхБумаг.СчетДоверительногоУправления.Родитель,
	|	_Настройки.ОтчетнаяДата,
	|	КурсыВалютСрезПоследних.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ОстаткиЦенныхБумаг.Организация КАК Организация,
	|	_ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ОстаткиЦенныхБумаг.ВидУчета КАК ВидУчета,
	|	_ОстаткиЦенныхБумаг.Рынок КАК Рынок,
	|	_ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ОстаткиЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	|	_ОстаткиЦенныхБумаг.ВалютаНоминала КАК ВалютаНоминала,
	|	КурсыВалют.Период КАК ДатаКурсаВалют,
	|	КурсыВалют.Курс КАК Курс,
	|	КурсыВалют.Кратность КАК Кратность,
	|	ВЫБОР
	|		КОГДА _Настройки.ЕдиныйБУ = ЛОЖЬ
	|			ТОГДА _ОстаткиЦенныхБумаг.СтоимостьОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА _Настройки.КорректировкиВСтоимости
	|					ТОГДА ЕСТЬNULL(_ОстаткиЦенныхБумаг.СтоимостьОстаток, 0) + ЕСТЬNULL(_ОстаткиЦенныхБумаг.ПереоценкаОстаток, 0) + ЕСТЬNULL(_ОстаткиЦенныхБумаг.ДисконтПремияНачисленныйОстаток, 0) + ЕСТЬNULL(_ОстаткиЦенныхБумаг.КорректировкаЭСПОстаток, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(_ОстаткиЦенныхБумаг.ДисконтПремияНачисленныйОстаток, 0) < 0
	|							ТОГДА ЕСТЬNULL(_ОстаткиЦенныхБумаг.СтоимостьОстаток, 0) + ЕСТЬNULL(_ОстаткиЦенныхБумаг.ПереоценкаОстаток, 0)
	|						ИНАЧЕ ЕСТЬNULL(_ОстаткиЦенныхБумаг.СтоимостьПокупкиОстаток, 0) + ЕСТЬNULL(_ОстаткиЦенныхБумаг.ПереоценкаОстаток, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК БалансоваяСтоимость,
	|	ВЫБОР
	|		КОГДА _Настройки.ЕдиныйБУ = ЛОЖЬ
	|			ТОГДА ЕСТЬNULL(_ОстаткиЦенныхБумаг.СтоимостьКупонаОстаток, 0)
	|		ИНАЧЕ ЕСТЬNULL(_ОстаткиЦенныхБумаг.СтоимостьКупонаОстаток, 0) + ЕСТЬNULL(_ОстаткиЦенныхБумаг.ПереоценкаКупонаОстаток, 0)
	|	КОНЕЦ КАК БалансоваяСтоимостьКупона,
	|	_ОстаткиЦенныхБумаг.КоличествоОстаток КАК Количество,
	|	_ОстаткиЦенныхБумаг.СтоимостьОстаток КАК Стоимость,
	|	_ОстаткиЦенныхБумаг.СтоимостьКупонаОстаток КАК СтоимостьКупона,
	|	_ОстаткиЦенныхБумаг.СтоимостьПокупкиОстаток КАК СтоимостьПокупки,
	|	_ОстаткиЦенныхБумаг.СтоимостьПокупкиКупонаОстаток КАК СтоимостьПокупкиКупона,
	|	_ОстаткиЦенныхБумаг.ПереоценкаОстаток КАК Переоценка,
	|	_ОстаткиЦенныхБумаг.ПереоценкаКупонаОстаток КАК ПереоценкаКупона,
	|	_ОстаткиЦенныхБумаг.ДисконтПремияНачисленныйОстаток КАК ДисконтПремия,
	|	_ОстаткиЦенныхБумаг.КорректировкаЭСПОстаток КАК КорректировкаЭСП
	|ИЗ
	|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыДействующихКурсовВалютДляАктивов КАК _ДатыДействующихКурсовВалютДляАктивов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|			ПО _ДатыДействующихКурсовВалютДляАктивов.Валюта = КурсыВалют.Валюта
	|				И _ДатыДействующихКурсовВалютДляАктивов.ДатаКурсаВалют = КурсыВалют.Период
	|		ПО _ОстаткиЦенныхБумаг.ЦеннаяБумага = _ДатыДействующихКурсовВалютДляАктивов.ЦеннаяБумага
	|			И _ОстаткиЦенныхБумаг.ВалютаНоминала = _ДатыДействующихКурсовВалютДляАктивов.Валюта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Настройки КАК _Настройки
	|		ПО (ИСТИНА)";
				  
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);  
	Запрос.УстановитьПараметр("КонецДняПериода", Новый Граница(Период, ВидГраницы.Включая)); 	
	// При контроле по правилам 710-П курс валют определяется на дату оценки
	ДатаКонтроля = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(
		, "ДатаНачалаКонтроляСтраховыхКомпанийПоПравилам710П", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ИспользоватьПравила710П", ДатаКонтроля <> Неопределено И ДатаКонтроля <= Период);
				  
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//ШаблонДляЗапросов = "ВЫБРАТЬ
	//                    |	_ЦенныеБумагиСК.Организация,
	//                    |	_ЦенныеБумагиСК.СчетДоверительногоУправления,
	//                    |	_ЦенныеБумагиСК.ВидУчета,
	//                    |	_ЦенныеБумагиСК.Рынок,
	//                    |	_ЦенныеБумагиСК.ЦеннаяБумага,
	//                    |	_ЦенныеБумагиСК.Учетны5йАктивЕПС,
	//                    |	_ЦенныеБумагиСК.ВалютаНоминала,
	//                    |	_ЦенныеБумагиСК.ДатаКурсаВалют,
	//                    |	_ЦенныеБумагиСК.Курс,
	//                    |	_ЦенныеБумагиСК.Кратность,
	//                    |	_ЦенныеБумагиСК.БалансоваяСтоимость,
	//                    |	_ЦенныеБумагиСК.БалансоваяСтоимостьКупона,
	//                    |	_ЦенныеБумагиСК.Количество,
	//                    |	_ЦенныеБумагиСК.Стоимость,
	//                    |	_ЦенныеБумагиСК.СтоимостьКупона,
	//                    |	_ЦенныеБумагиСК.СтоимостьПокупки,
	//                    |	_ЦенныеБумагиСК.СтоимостьПокупкиКупона,
	//                    |	_ЦенныеБумагиСК.Переоценка,
	//                    |	_ЦенныеБумагиСК.ПереоценкаКупона,
	//                    |	_ЦенныеБумагиСК.ДисконтПремия,
	//                    |	_ЦенныеБумагиСК.КорректировкаЭСП
	//                    |ПОМЕСТИТЬ _СтоимостьЦенныхБумагСтраховойКомпании
	//                    |ИЗ
	//                    |	&СтоимостьЦенныхБумагСтраховойКомпании КАК _ЦенныеБумагиСК";
	Возврат Результат; 
	
	
КонецФункции
	
Функция ПолучитьСтоимостьДепозитныхВкладовСтраховойКомпании (СчетДоверительногоУправления, Организация, Период) Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ДанныеКалендаря.Дата) КАК ОтчетнаяДата,
		|	&Период КАК Период,
		|	НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет КАК ЕдиныйБУ
		|ПОМЕСТИТЬ _Настройки
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаОбщиеСрезПоследних
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ДанныеКалендаря.Дата <= &Период
		|	И КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовСтраховыхКомпанийСрезПоследних.Организация КАК Организация,
		|	СтоимостьАктивовСтраховыхКомпанийСрезПоследних.СчетДоверительногоУправления.Родитель КАК СчетДоверительногоУправленияРодитель,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(СтоимостьАктивовСтраховыхКомпанийСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта <> СтоимостьАктивовСтраховыхКомпанийСрезПоследних.Организация.ВалютаУчета
		|			ТОГДА СтоимостьАктивовСтраховыхКомпанийСрезПоследних.КредитныйИнструмент
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Актив,
		|	ВЫРАЗИТЬ(СтоимостьАктивовСтраховыхКомпанийСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта КАК Валюта,
		|	НАЧАЛОПЕРИОДА(МАКСИМУМ(ЕСТЬNULL(ДенежныеСредстваВКредитныхИнструментах.Период, _Настройки.ОтчетнаяДата)), ДЕНЬ) КАК ДатаКурсаВалют
		|ПОМЕСТИТЬ _ДатыДействующихКурсовВалютДляАктивов
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК СтоимостьАктивовСтраховыхКомпанийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Настройки КАК _Настройки
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах КАК ДенежныеСредстваВКредитныхИнструментах
		|		ПО СтоимостьАктивовСтраховыхКомпанийСрезПоследних.Организация = ДенежныеСредстваВКредитныхИнструментах.Организация
		|			И СтоимостьАктивовСтраховыхКомпанийСрезПоследних.СчетДоверительногоУправления = ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления
		|			И СтоимостьАктивовСтраховыхКомпанийСрезПоследних.КредитныйИнструмент = ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент
		|			И (ДенежныеСредстваВКредитныхИнструментах.Период МЕЖДУ _Настройки.ОтчетнаяДата И КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
		|ГДЕ
		|	&Период > ДАТАВРЕМЯ(2016, 12, 31, 0, 0, 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(СтоимостьАктивовСтраховыхКомпанийСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(СтоимостьАктивовСтраховыхКомпанийСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта <> СтоимостьАктивовСтраховыхКомпанийСрезПоследних.Организация.ВалютаУчета
		|			ТОГДА СтоимостьАктивовСтраховыхКомпанийСрезПоследних.КредитныйИнструмент
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	СтоимостьАктивовСтраховыхКомпанийСрезПоследних.Организация,
		|	СтоимостьАктивовСтраховыхКомпанийСрезПоследних.СчетДоверительногоУправления.Родитель,
		|	_Настройки.ОтчетнаяДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыДействующихКурсовВалютДляАктивов.Актив КАК Актив,
		|	_ДатыДействующихКурсовВалютДляАктивов.Валюта КАК Валюта,
		|	_ДатыДействующихКурсовВалютДляАктивов.ДатаКурсаВалют КАК ДатаКурсаВалют,
		|	ЕСТЬNULL(КурсыВалют.Курс, 1) КАК Курс,
		|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК Кратность
		|ПОМЕСТИТЬ _ДействующиеКурсыВалютныхАктивов
		|ИЗ
		|	_ДатыДействующихКурсовВалютДляАктивов КАК _ДатыДействующихКурсовВалютДляАктивов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО _ДатыДействующихКурсовВалютДляАктивов.Валюта = КурсыВалют.Валюта
		|			И _ДатыДействующихКурсовВалютДляАктивов.ДатаКурсаВалют = КурсыВалют.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиНоминалов.ЛицевойСчет.ДепозитныйВклад КАК ДепозитныйВклад,
		|	ЕдиныйБухгалтерскийУчетОстаткиНоминалов.ВалютнаяСуммаОстаток КАК Номинал,
		|	ЕдиныйБухгалтерскийУчетОстаткиПроцентов.ВалютнаяСуммаОстаток КАК Проценты
		|ПОМЕСТИТЬ _ЕПСДепозиты
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиНоминалов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиПроцентов
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиНоминалов.ЛицевойСчет.ДепозитныйВклад = ЕдиныйБухгалтерскийУчетОстаткиПроцентов.Субконто1
		|ГДЕ
		|	НЕ ЕдиныйБухгалтерскийУчетОстаткиНоминалов.ЛицевойСчет.ДепозитныйВклад ЕСТЬ NULL
		|	И НЕ ЕдиныйБухгалтерскийУчетОстаткиНоминалов.ЛицевойСчет.ДепозитныйВклад = ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент КАК ДепозитныйВклад,
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток КАК СуммаДепозитногоВкладаБУ,
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток * ЕСТЬNULL(ЕСТЬNULL(_ДействующиеКурсыВалютныхАктивов.Курс, КурсыВалютСрезПоследних.Курс), 1) / ЕСТЬNULL(ЕСТЬNULL(_ДействующиеКурсыВалютныхАктивов.Кратность, КурсыВалютСрезПоследних.Кратность), 1) КАК СуммаДепозитногоВкладаВВалютеУчетаБУ,
		|	_ЕПСДепозиты.Номинал КАК НоминалЕПС,
		|	_ЕПСДепозиты.Проценты КАК ПроцентыЕПС,
		|	ВЫБОР
		|		КОГДА _Настройки.ЕдиныйБУ = ИСТИНА
		|			ТОГДА ЕСТЬNULL(_ЕПСДепозиты.Номинал, 0) + ЕСТЬNULL(_ЕПСДепозиты.Проценты, 0)
		|		ИНАЧЕ ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток
		|	КОНЕЦ КАК БалансоваяСтоимостьДепозитногоВклада,
		|	ЕСТЬNULL(КурсыВалютФиксированнаяДата.Период, _ДействующиеКурсыВалютныхАктивов.ДатаКурсаВалют) КАК ДатаКурсаВалют,
		|	ЕСТЬNULL(КурсыВалютФиксированнаяДата.Курс, ЕСТЬNULL(ЕСТЬNULL(_ДействующиеКурсыВалютныхАктивов.Курс, КурсыВалютСрезПоследних.Курс), 1)) КАК Курс,
		|	ЕСТЬNULL(ЕСТЬNULL(_ДействующиеКурсыВалютныхАктивов.Кратность, КурсыВалютСрезПоследних.Кратность), 1) КАК Кратность,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта, ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ВалютаУчета) КАК Валюта
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДействующиеКурсыВалютныхАктивов КАК _ДействующиеКурсыВалютныхАктивов
		|		ПО (_ДействующиеКурсыВалютныхАктивов.Актив = ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент)
		|			И (ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта = _ДействующиеКурсыВалютныхАктивов.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта = КурсыВалютСрезПоследних.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЕПСДепозиты КАК _ЕПСДепозиты
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = _ЕПСДепозиты.ДепозитныйВклад
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Настройки КАК _Настройки
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(ДАТАВРЕМЯ(2022, 2, 18), ) КАК КурсыВалютФиксированнаяДата
		|		ПО (ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта = КурсыВалютФиксированнаяДата.Валюта)
		|			И (ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).КодСчета В (""6/DSK"", ""8/DSK"", ""11/DSK""))
		|			И (&Период >= ДАТАВРЕМЯ(2022, 2, 28))
		|			И (&Период <= ДАТАВРЕМЯ(2023, 1, 1))";
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	//ШаблонДляЗапросов = "ВЫБРАТЬ   _ОстаткиНаДепозитныхВкладах.СчетДоверительногоУправления,
	//                    |	_ОстаткиНаДепозитныхВкладах.ДепозитныйВклад,
	//                    |	_ОстаткиНаДепозитныхВкладах.СуммаДепозитногоВкладаБУ,
	//                    |	_ОстаткиНаДепозитныхВкладах.СуммаДепозитногоВкладаВВалютеУчетаБУ,
	//                    |	_ОстаткиНаДепозитныхВкладах.НоминалЕПС,
	//                    |	_ОстаткиНаДепозитныхВкладах.ПроцентыЕПС,
	//                    |	_ОстаткиНаДепозитныхВкладах.БалансоваяСтоимостьДепозитногоВклада,
	//                    |	_ОстаткиНаДепозитныхВкладах.ДатаКурсаВалют,
	//                    |	_ОстаткиНаДепозитныхВкладах.Курс,
	//                    |	_ОстаткиНаДепозитныхВкладах.Кратность,
	//                    |	_ОстаткиНаДепозитныхВкладах.Валюта
	//                    |ПОМЕСТИТЬ _ОстаткиНаДепозитныхВкладахСтраховойКомпании
	//                    |ИЗ
	//                    |	&ОстаткиНаДепозитныхВкладах КАК _ОстаткиНаДепозитныхВкладах;";
	//
	
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Возврат Результат; 

КонецФункции

Функция ПолучитьКурсыВалютДляАктивовСтраховойКомпании(ВалютныеАктивыТаблица, Период, Организация) Экспорт
	 	
	ОтчетнаяДата = ?(ЗначениеЗаполнено(Период),Период,КонецДня(ТекущаяДата()));
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ДанныеКалендаря.Дата) КАК ОтчетнаяДата
	|ИЗ
	|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
	|ГДЕ
	|	ДанныеКалендаря.Дата <= &Период
	|	И КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ)
	|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)";
	
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период),Период,КонецДня(ТекущаяДата()))); 
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОтчетнаяДата = ВыборкаДетальныеЗаписи.ОтчетнаяДата;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВалютныеАктивыТаблица.Актив КАК Актив,
	|	ВалютныеАктивыТаблица.Валюта КАК Валюта,
	|	ВалютныеАктивыТаблица.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	&ОтчетнаяДата КАК ОтчетнаяДата
	|ПОМЕСТИТЬ _АктивыСтраховойКомпанииДоПроверки
	|ИЗ
	|	&ВалютныеАктивыТаблица КАК ВалютныеАктивыТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_АктивыСтраховойКомпанииДоПроверки.Актив КАК Актив,
	|	_АктивыСтраховойКомпанииДоПроверки.Валюта КАК Валюта,
	|	_АктивыСтраховойКомпанииДоПроверки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ВЫБОР
	|		КОГДА ЗначенияДополнительныхСведений.Значение <= &Период
	|			ТОГДА &период
	|		ИНАЧЕ _АктивыСтраховойКомпанииДоПроверки.ОтчетнаяДата
	|	КОНЕЦ КАК ОтчетнаяДата
	|ПОМЕСТИТЬ _АктивыСтраховойКомпании
	|ИЗ
	|	_АктивыСтраховойКомпанииДоПроверки КАК _АктивыСтраховойКомпанииДоПроверки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
	|		ПО _АктивыСтраховойКомпанииДоПроверки.СчетДоверительногоУправления = ЗначенияДополнительныхСведений.Объект
	|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""ДатаНачалаКонтроляСтраховыхКомпанийПоПравилам710П"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ОстаткиЦенныхБумаг.Период, ДЕНЬ)) КАК ДатаПоследнейОперации,
	|	ОстаткиЦенныхБумаг.ЦеннаяБумага КАК Актив,
	|	ОстаткиЦенныхБумаг.Организация КАК Организация,
	|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_АктивыСтраховойКомпании.Валюта КАК Валюта
	|ПОМЕСТИТЬ _ПоследниеОперацииНадАктивамиСтраховойКомпании
	|ИЗ
	|	_АктивыСтраховойКомпании КАК _АктивыСтраховойКомпании
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
	|		ПО (ОстаткиЦенныхБумаг.ЦеннаяБумага = _АктивыСтраховойКомпании.Актив)
	|			И (ОстаткиЦенныхБумаг.СчетДоверительногоУправления = _АктивыСтраховойКомпании.СчетДоверительногоУправления)
	|			И (ОстаткиЦенныхБумаг.ЦеннаяБумага.ВалютаНоминала = _АктивыСтраховойКомпании.Валюта)
	|			И (ОстаткиЦенныхБумаг.Период МЕЖДУ НАЧАЛОПЕРИОДА(_АктивыСтраховойКомпании.ОтчетнаяДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
	|ГДЕ
	|	ОстаткиЦенныхБумаг.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦенныхБумаг.ЦеннаяБумага,
	|	ОстаткиЦенныхБумаг.Организация,
	|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления,
	|	_АктивыСтраховойКомпании.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ)),
	|	ОстаткиДенежныхСредств.РасчетныйСчет,
	|	ОстаткиДенежныхСредств.Организация,
	|	ОстаткиДенежныхСредств.СчетДоверительногоУправления,
	|	_АктивыСтраховойКомпании.Валюта
	|ИЗ
	|	_АктивыСтраховойКомпании КАК _АктивыСтраховойКомпании
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
	|		ПО (ОстаткиДенежныхСредств.РасчетныйСчет = _АктивыСтраховойКомпании.Актив)
	|			И (ОстаткиДенежныхСредств.СчетДоверительногоУправления = _АктивыСтраховойКомпании.СчетДоверительногоУправления)
	|			И _АктивыСтраховойКомпании.Валюта = ОстаткиДенежныхСредств.Валюта
	|			И (ОстаткиДенежныхСредств.Период МЕЖДУ НАЧАЛОПЕРИОДА(_АктивыСтраховойКомпании.ОтчетнаяДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
	|ГДЕ
	|	ОстаткиДенежныхСредств.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиДенежныхСредств.РасчетныйСчет,
	|	ОстаткиДенежныхСредств.Организация,
	|	ОстаткиДенежныхСредств.СчетДоверительногоУправления,
	|	_АктивыСтраховойКомпании.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ДенежныеСредстваВКредитныхИнструментах.Период, ДЕНЬ)),
	|	ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент,
	|	ДенежныеСредстваВКредитныхИнструментах.Организация,
	|	ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления,
	|	_АктивыСтраховойКомпании.Валюта
	|ИЗ
	|	_АктивыСтраховойКомпании КАК _АктивыСтраховойКомпании
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах КАК ДенежныеСредстваВКредитныхИнструментах
	|		ПО _АктивыСтраховойКомпании.Актив = ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент
	|			И (ДенежныеСредстваВКредитныхИнструментах.ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад))
	|			И (ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления = _АктивыСтраховойКомпании.СчетДоверительногоУправления)
	|			И (ДенежныеСредстваВКредитныхИнструментах.Период МЕЖДУ НАЧАЛОПЕРИОДА(_АктивыСтраховойКомпании.ОтчетнаяДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
	|ГДЕ
	|	ДенежныеСредстваВКредитныхИнструментах.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент,
	|	ДенежныеСредстваВКредитныхИнструментах.Организация,
	|	ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления,
	|	_АктивыСтраховойКомпании.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_АктивыСтраховойКомпании.Актив КАК Актив,
	|	_АктивыСтраховойКомпании.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_АктивыСтраховойКомпании.Валюта КАК Валюта,
	|	ЕСТЬNULL(КурсыВалютФиксированнаяДата.Период, ЕСТЬNULL(КурсыВалютНаДатуПоследнейОперацииИлиОтчетногоПериода.Период, КурсыВалютСрезПоследних.Период)) КАК ДатаКурсаВалют,
	|	ЕСТЬNULL(КурсыВалютФиксированнаяДата.Курс, ЕСТЬNULL(КурсыВалютНаДатуПоследнейОперацииИлиОтчетногоПериода.Курс, КурсыВалютСрезПоследних.Курс)) КАК Курс,
	|	ЕСТЬNULL(КурсыВалютФиксированнаяДата.Кратность, ЕСТЬNULL(КурсыВалютНаДатуПоследнейОперацииИлиОтчетногоПериода.Кратность, КурсыВалютСрезПоследних.Кратность)) КАК Кратность
	|ПОМЕСТИТЬ _КурсыВалютАктивовСтраховойКомпании
	|ИЗ
	|	_АктивыСтраховойКомпании КАК _АктивыСтраховойКомпании
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеОперацииНадАктивамиСтраховойКомпании КАК _ПоследниеОперацииНадАктивамиСтраховойКомпании
	|		ПО _АктивыСтраховойКомпании.Актив = _ПоследниеОперацииНадАктивамиСтраховойКомпании.Актив
	|			И _АктивыСтраховойКомпании.СчетДоверительногоУправления = _ПоследниеОперацииНадАктивамиСтраховойКомпании.СчетДоверительногоУправления
	|			И _АктивыСтраховойКомпании.Валюта = _ПоследниеОперацииНадАктивамиСтраховойКомпании.Валюта
	|			И (ГОД(&Период) >= 2017)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютНаДатуПоследнейОперацииИлиОтчетногоПериода
	|		ПО _АктивыСтраховойКомпании.Валюта = КурсыВалютНаДатуПоследнейОперацииИлиОтчетногоПериода.Валюта
	|			И (КурсыВалютНаДатуПоследнейОперацииИлиОтчетногоПериода.Период = ЕСТЬNULL(_ПоследниеОперацииНадАктивамиСтраховойКомпании.ДатаПоследнейОперации, _АктивыСтраховойКомпании.ОтчетнаяДата))
	|			И (ГОД(&Период) >= 2017)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	|		ПО _АктивыСтраховойКомпании.Валюта = КурсыВалютСрезПоследних.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(ДАТАВРЕМЯ(2022, 2, 18), ) КАК КурсыВалютФиксированнаяДата
	|		ПО _АктивыСтраховойКомпании.Валюта = КурсыВалютФиксированнаяДата.Валюта
	|			И (ВЫРАЗИТЬ(_АктивыСтраховойКомпании.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).КодСчета В (""6/DSK"", ""8/DSK"", ""11/DSK""))
	|			И (&Период >= ДАТАВРЕМЯ(2022, 2, 28))
	|			И (&Период <= ДАТАВРЕМЯ(2023, 1, 1))
	|ГДЕ
	|	НЕ _АктивыСтраховойКомпании.Актив В (ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.Облигации.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.Акции.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_КурсыВалютАктивовСтраховойКомпании.Актив КАК Актив,
	|	_КурсыВалютАктивовСтраховойКомпании.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_КурсыВалютАктивовСтраховойКомпании.Валюта КАК Валюта,
	|	_КурсыВалютАктивовСтраховойКомпании.ДатаКурсаВалют КАК ДатаКурсаВалют,
	|	_КурсыВалютАктивовСтраховойКомпании.Курс КАК Курс,
	|	_КурсыВалютАктивовСтраховойКомпании.Кратность КАК Кратность
	|ИЗ
	|	_КурсыВалютАктивовСтраховойКомпании КАК _КурсыВалютАктивовСтраховойКомпании";
	
	
	//ШаблонДляЗапросов = "ВЫБРАТЬ
	//               |	_КурсыВалютАктивовСтраховойКомпании.Актив КАК Актив,
	//               |	_КурсыВалютАктивовСтраховойКомпании.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	//               |	_КурсыВалютАктивовСтраховойКомпании.Валюта КАК Валюта,
	//               |	_КурсыВалютАктивовСтраховойКомпании.ДатаКурсаВалют КАК ДатаКурсаВалют,
	//               |	_КурсыВалютАктивовСтраховойКомпании.Курс КАК Курс,
	//               |	_КурсыВалютАктивовСтраховойКомпании.Кратность КАК Кратность
	//				 | ПОМЕСТИТЬ _КурсыВалютАктивовСтраховойКомпании
	//               |ИЗ
	//               |	&КурсыВалютАктивовСтраховойКомпании КАК _КурсыВалютАктивовСтраховойКомпании;";


	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчетнаяДата", ОтчетнаяДата); 	
	Запрос.УстановитьПараметр("ВалютныеАктивыТаблица", ВалютныеАктивыТаблица);
	
	
	Результат = Запрос.Выполнить().Выгрузить();

	
	
	
	Возврат Результат;
	
КонецФункции

// Получить полную балансовую стоимость актива. Для депозитного вклада: номинал + проценты. Для облигаций: стоимость + купон.
Функция ПолучитьБалансовуюСтоимостьАктиваСтраховойКомпанииВВалютеУчета (СчетДоверительногоУправления, Организация, Период, АктивСтраховойКомпании, 
	ВалютаАктива, СубъектПрочегоАктива) Экспорт
	
	// Для расчета стоимости валютного актива в рублях требуется определить используемую дату курса валют.
	// По единым правилам дата курса равна "отчетной дате" (последнему дню предыдущего месяца) или дате операции, если операция произведена позже.
	// Это правило не касается валютных прочих активов, а также остатков на расчетных счетах, поскольку данные об этих остатках поступают от клиентов, которые 
	// обязаны самостоятельно соблюдать данное правило.
	
	ДатаВалютногоКурса = Период; // Для прочих активо и д.с.		
	ВалютаУчета = Организация.ВалютаУчета;
	ОтчетнаяДата = ?(КонецДня(Период) = КонецМесяца(Период), Период, НачалоМесяца(Период) - 24*3600); 
	//ОтчетнаяДата = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ОтчетнаяДата);
	
	ДатаКурсаРавнаДатеОценки = ложь;
	ДатаДействияПравил = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(
		, "ДатаНачалаКонтроляСтраховыхКомпанийПоПравилам710П", СчетДоверительногоУправления);  
		
	Если ДатаДействияПравил <> Неопределено Тогда
			
		Если Период >= ДатаДействияПравил Тогда
				
			ОтчетнаяДата = Период;
			ДатаКурсаРавнаДатеОценки = Истина;
				
		КонецЕсли;
			
	КонецЕсли;
			
	ДатаВалютногоКурса = ОтчетнаяДата;
	
	Если ТипЗнч(АктивСтраховойКомпании) <> Тип("СправочникСсылка.ПрочиеАктивы") Тогда
	
	 
		Если ВалютаУчета <> ВалютаАктива Тогда
			
			Запрос = Новый Запрос();
			
			Если ТипЗнч(АктивСтраховойКомпании) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
				
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	МАКСИМУМ(ДенежныеСредстваВКредитныхИнструментах.Период) КАК ДатаПоследнейОперации
				|ИЗ
				|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах КАК ДенежныеСредстваВКредитныхИнструментах
				|ГДЕ
				|	ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент = &АктивСтраховойКомпании
				|	И ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления = &СчетДоверительногоУправления
				|	И ДенежныеСредстваВКредитныхИнструментах.Организация = &Организация
				|	И ДенежныеСредстваВКредитныхИнструментах.Период МЕЖДУ &ОтчетнаяДата И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)";
				
				Запрос.УстановитьПараметр("АктивСтраховойКомпании", АктивСтраховойКомпании);
				Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ОтчетнаяДата", ОтчетнаяДата);
				Запрос.УстановитьПараметр("Период", Период);
				
				РезультатЗапроса = Запрос.Выполнить().Выбрать();
				
				Если РезультатЗапроса.Следующий() и ЗначениеЗаполнено(РезультатЗапроса.ДатаПоследнейОперации) и НЕ ДатаКурсаРавнаДатеОценки Тогда
					ДатаВалютногоКурса = РезультатЗапроса.ДатаПоследнейОперации;
				КонецЕсли;			
				
			ИначеЕсли ТипЗнч(АктивСтраховойКомпании) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	МАКСИМУМ(ОстаткиДенежныхСредств.Период) КАК ДатаПоследнейОперации
				|ИЗ
				|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
				|ГДЕ
				|	ОстаткиДенежныхСредств.РасчетныйСчет = &АктивСтраховойКомпании
				|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
				|	И ОстаткиДенежныхСредств.Организация = &Организация
				|	И ОстаткиДенежныхСредств.Период МЕЖДУ &ОтчетнаяДата И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)";
				
				Запрос.УстановитьПараметр("АктивСтраховойКомпании", АктивСтраховойКомпании);
				Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ОтчетнаяДата", ОтчетнаяДата);
				Запрос.УстановитьПараметр("Период", Период);
				
				РезультатЗапроса = Запрос.Выполнить().Выбрать();
				
				Если РезультатЗапроса.Следующий() и ЗначениеЗаполнено(РезультатЗапроса.ДатаПоследнейОперации) и НЕ ДатаКурсаРавнаДатеОценки Тогда
					ДатаВалютногоКурса = РезультатЗапроса.ДатаПоследнейОперации;
				КонецЕсли;
			Иначе
				// Акции, Облигации, ДРы, ИСУ, Паи.
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	МАКСИМУМ(БухПартииЦенныхБумаг.Период) КАК ДатаПоследнейОперации
				|ИЗ
				|	РегистрНакопления.ОстаткиЦенныхБумаг КАК БухПартииЦенныхБумаг
				|ГДЕ
				|	БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
				|	И БухПартииЦенныхБумаг.Организация = &Организация
				|	И БухПартииЦенныхБумаг.ЦеннаяБумага = &АктивСтраховойКомпании
				|	И БухПартииЦенныхБумаг.Период МЕЖДУ &ОтчетнаяДата И &Период";
				
				Запрос.УстановитьПараметр("АктивСтраховойКомпании", АктивСтраховойКомпании);
				Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ОтчетнаяДата", ОтчетнаяДата);
				Запрос.УстановитьПараметр("Период", Период);
				
				РезультатЗапроса = Запрос.Выполнить().Выбрать();
				
				Если РезультатЗапроса.Следующий() и ЗначениеЗаполнено(РезультатЗапроса.ДатаПоследнейОперации) и НЕ ДатаКурсаРавнаДатеОценки Тогда
					ДатаВалютногоКурса = РезультатЗапроса.ДатаПоследнейОперации;
				КонецЕсли;				
				
			КонецЕсли;						
			
		КонецЕсли;		 
		
	КонецЕсли;

	// Фиксация валютного курса  	 	
	Если СчетДоверительногоУправления.КодСчета = "6/DSK" Или
		СчетДоверительногоУправления.КодСчета = "8/DSK"  Или
		СчетДоверительногоУправления.КодСчета = "11/DSK"  Тогда
		ДатаФиксацииКурсовВалют = Дата(2022,2,18);
		Если ДатаВалютногоКурса >= Дата(2022,2,28) и ДатаВалютногоКурса <= Дата(2023,1,1) Тогда
			  ДатаВалютногоКурса = ДатаФиксацииКурсовВалют;
		КонецЕсли;
	КонецЕсли;

	

	// Формулы расчета стоимости актива страховой компании.
	// 1) Ценные бумаги  = РН БухПартииЦенныхБумаг:
	// 1.1 Номинал
	//  Для счета ДУ: ВключатьПроцентныеДоходыИКорректировкиВБалансовуюСтоимостьПриПереоценке?
	//	
	//	да:  СтоимостьОстаток + ПереоценкаОстаток + ДисконтПремияНачисленныйОстаток + КорректировкаЭСПОстаток
	//	нет: 
	//			ДисконтПремияНачисленныйОстаток < 0?
	//					да:  СтоимостьОстаток + ПереоценкаОстаток
	//					нет: СтоимостьПокупкиОстаток + ПереоценкаОстаток
	// 1.2 Купон
	//	СтоимостьКупонаОстаток + ПереоценкаКупонаОстаток
	// 2) Депозиты = РБ ЕдиныйБухгалтерскийУчет.
	// 3) Д.с на расчетных счетах = РН ОстаткиДенежныхСредств.
	// 4) Прочие активы = РН ОстаткиПрочихАктивов.
	
	Результат = Новый Структура();
	Результат.Вставить("Актив", АктивСтраховойКомпании);
	Результат.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Результат.Вставить("Валюта", ВалютаАктива);
	Результат.Вставить("ДатаКурсаВалют", ДатаВалютногоКурса);
	Результат.Вставить("БалансоваяСтоимость", 0);    
	Результат.Вставить("БалансоваяСтоимостьРЕПО", 0); 
	Результат.Вставить("ЭтоВалютныйАктив", Ложь);
	Если ВалютаУчета <> ВалютаАктива Тогда
		Результат["ЭтоВалютныйАктив"] = Истина;
	КонецЕсли;
	
	Если ТипЗнч(АктивСтраховойКомпании) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
									
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиНоминалов.ЛицевойСчет.ДепозитныйВклад КАК ДепозитныйВклад,
		|	ЕдиныйБухгалтерскийУчетОстаткиНоминалов.ВалютнаяСуммаОстаток КАК Номинал,
		|	ЕдиныйБухгалтерскийУчетОстаткиПроцентов.ВалютнаяСуммаОстаток КАК Проценты,
		|	ЕдиныйБухгалтерскийУчетОстаткиНоминалов.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность,
		|	КурсыВалютСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ _ОстаткиДепозитовНаДату
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДепозитныйВклад = &АктивСтраховойКомпании) КАК ЕдиныйБухгалтерскийУчетОстаткиНоминалов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиПроцентов
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиНоминалов.ЛицевойСчет.ДепозитныйВклад = ЕдиныйБухгалтерскийУчетОстаткиПроцентов.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаВалютногоКурса, ) КАК КурсыВалютСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстаткиНоминалов.Валюта = КурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	НЕ ЕдиныйБухгалтерскийУчетОстаткиНоминалов.ЛицевойСчет.ДепозитныйВклад ЕСТЬ NULL
		|	И НЕ ЕдиныйБухгалтерскийУчетОстаткиНоминалов.ЛицевойСчет.ДепозитныйВклад = ЗНАЧЕНИЕ(Справочник.ДепозитныеВклады.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиДепозитовНаДату.ДепозитныйВклад КАК АктивСтраховойКомпании,
		|	(ЕСТЬNULL(_ОстаткиДепозитовНаДату.Номинал, 0) + ЕСТЬNULL(_ОстаткиДепозитовНаДату.Проценты, 0)) * ЕСТЬNULL(_ОстаткиДепозитовНаДату.Курс, 1) / ЕСТЬNULL(_ОстаткиДепозитовНаДату.Кратность, 1) КАК БалансоваяСтоимость,
		|	_ОстаткиДепозитовНаДату.Период КАК ДатаКурсаВалют
		|ИЗ
		|	_ОстаткиДепозитовНаДату КАК _ОстаткиДепозитовНаДату";
		
		Запрос.УстановитьПараметр("АктивСтраховойКомпании", АктивСтраховойКомпании);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ДатаВалютногоКурса", ДатаВалютногоКурса);
		Запрос.УстановитьПараметр("Период", Период);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
				
		Если РезультатЗапроса.Следующий() Тогда
			Результат["БалансоваяСтоимость"] = РезультатЗапроса.БалансоваяСтоимость;
			Результат["ДатаКурсаВалют"] = РезультатЗапроса.ДатаКурсаВалют;
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если ТипЗнч(АктивСтраховойКомпании) = Тип("СправочникСсылка.ПрочиеАктивы") Тогда	
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиПрочихАктивовОстатки.Актив КАК АктивСтраховойКомпании,
		|	ОстаткиПрочихАктивовОстатки.Субъект КАК Субъект,
		|	ОстаткиПрочихАктивовОстатки.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА ОценкиСтоимостьИмуществаСрезПоследних.Стоимость ЕСТЬ NULL
		|			ТОГДА ОстаткиПрочихАктивовОстатки.СуммаОстаток
		|		КОГДА ОценкиСтоимостьИмуществаСрезПоследних.Стоимость > 0
		|				И ОценкиСтоимостьИмуществаСрезПоследних.Стоимость < ОстаткиПрочихАктивовОстатки.СуммаОстаток
		|			ТОГДА ОценкиСтоимостьИмуществаСрезПоследних.Стоимость
		|		ИНАЧЕ ОстаткиПрочихАктивовОстатки.СуммаОстаток
		|	КОНЕЦ * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК БалансоваяСтоимость,
		|	КурсыВалютСрезПоследних.Период КАК ДатаКурсаВалют
		|ИЗ
		|	РегистрНакопления.ОстаткиПрочихАктивов.Остатки(
		|			&Период,
		|			Актив = &АктивСтраховойКомпании
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЕСТЬNULL(Субъект, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) = ЕСТЬNULL(&СубъектПрочегоАктива, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
		|				И Валюта = &ВалютаАктива) КАК ОстаткиПрочихАктивовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаВалютногоКурса, ) КАК КурсыВалютСрезПоследних
		|		ПО ОстаткиПрочихАктивовОстатки.Валюта = КурсыВалютСрезПоследних.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостьИмущества.СрезПоследних(&Период, Организация = &Организация) КАК ОценкиСтоимостьИмуществаСрезПоследних
		|		ПО (ОстаткиПрочихАктивовОстатки.Актив = ОценкиСтоимостьИмуществаСрезПоследних.Имущество
		|				И ОстаткиПрочихАктивовОстатки.Актив.ВидПрочегоАктива = ЗНАЧЕНИЕ(Справочник.ВидыПрочихАктивов.НедвижимоеИмущество))";
		
		Запрос.УстановитьПараметр("АктивСтраховойКомпании", АктивСтраховойКомпании);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СубъектПрочегоАктива", СубъектПрочегоАктива);
		Запрос.УстановитьПараметр("ДатаВалютногоКурса", ДатаВалютногоКурса);
		Запрос.УстановитьПараметр("Период", Период);  
		Запрос.УстановитьПараметр("ВалютаАктива", ВалютаАктива);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();

		Если РезультатЗапроса.Следующий() Тогда
			Результат["БалансоваяСтоимость"] = РезультатЗапроса.БалансоваяСтоимость;
			Результат["ДатаКурсаВалют"] = РезультатЗапроса.ДатаКурсаВалют;

		КонецЕсли;
		
		Возврат Результат;

		
	КонецЕсли;

	Если ТипЗнч(АктивСтраховойКомпании) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОстатки.РасчетныйСчет КАК РасчетныйСчет,
		|	ЕСТЬNULL(ОстаткиДенежныхСредствОстатки.СуммаОстаток, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) КАК БалансоваяСтоимость,
		|	КурсыВалютСрезПоследних.Период КАК ДатаКурсаВалют
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&Период,
		|			Валюта = &ВалютаАктива
		|				И Организация = &Организация
		|				И РасчетныйСчет = &АктивСтраховойКомпании
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиДенежныхСредствОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаВалютногоКурса, ) КАК КурсыВалютСрезПоследних
		|		ПО ОстаткиДенежныхСредствОстатки.Валюта = КурсыВалютСрезПоследних.Валюта";
		
		Запрос.УстановитьПараметр("АктивСтраховойКомпании", АктивСтраховойКомпании);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ДатаВалютногоКурса", ДатаВалютногоКурса);
		Запрос.УстановитьПараметр("Период", Период);  
		Запрос.УстановитьПараметр("ВалютаАктива", ВалютаАктива);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();

		Если РезультатЗапроса.Следующий() Тогда
			Результат["БалансоваяСтоимость"] = РезультатЗапроса.БалансоваяСтоимость;
		КонецЕсли;
		
		Возврат Результат; 
		
	КонецЕсли;
	
	// Остатки ценных бумаг.
	ДоходыВСтоимости = БухгалтерскийУчет.ОпределитьНастройкуУчета(Период, Организация, СчетДоверительногоУправления, "ВключатьПроцентныеДоходыИКорректировкиВБалансовуюСтоимостьПриПереоценке");
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.Организация КАК Организация,
	|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК АктивСтраховойКомпании,
	|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
	|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
	|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
	|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
	|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
	|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупкиОстаток,
	|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупонаОстаток,
	|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупонаОстаток,
	|	&ВалютаАктива КАК Валюта
	|ПОМЕСТИТЬ _ОстаткиЦенныхБумаг
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ЦеннаяБумага = &АктивСтраховойКомпании) КАК БухПартииЦенныхБумагОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ОстаткиЦенныхБумаг.АктивСтраховойКомпании КАК АктивСтраховойКомпании,
	|	(ВЫБОР
	|		КОГДА &ДоходыВСтоимости
	|			ТОГДА _ОстаткиЦенныхБумаг.СтоимостьОстаток + _ОстаткиЦенныхБумаг.ПереоценкаОстаток + _ОстаткиЦенныхБумаг.ДисконтПремияНачисленныйОстаток + _ОстаткиЦенныхБумаг.КорректировкаЭСПОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА _ОстаткиЦенныхБумаг.ДисконтПремияНачисленныйОстаток < 0
	|					ТОГДА _ОстаткиЦенныхБумаг.СтоимостьОстаток + _ОстаткиЦенныхБумаг.ПереоценкаОстаток
	|				ИНАЧЕ _ОстаткиЦенныхБумаг.СтоимостьПокупкиОстаток + _ОстаткиЦенныхБумаг.ПереоценкаОстаток
	|			КОНЕЦ
	|	КОНЕЦ + _ОстаткиЦенныхБумаг.СтоимостьКупонаОстаток + _ОстаткиЦенныхБумаг.ПереоценкаКупонаОстаток) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК БалансоваяСтоимость,
	|	КурсыВалютСрезПоследних.Период КАК ДатаКурсаВалют
	|ИЗ
	|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаВалютногоКурса, ) КАК КурсыВалютСрезПоследних
	|		ПО _ОстаткиЦенныхБумаг.Валюта = КурсыВалютСрезПоследних.Валюта"; 			
	
	Запрос.УстановитьПараметр("АктивСтраховойКомпании", АктивСтраховойКомпании);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаВалютногоКурса", ДатаВалютногоКурса);
	Запрос.УстановитьПараметр("Период", Период);  
	Запрос.УстановитьПараметр("ВалютаАктива", ВалютаАктива); 	
	Запрос.УстановитьПараметр("ДоходыВСтоимости", ДоходыВСтоимости);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Если РезультатЗапроса.Следующий() Тогда
		Результат["БалансоваяСтоимость"] = РезультатЗапроса.БалансоваяСтоимость;
	КонецЕсли;
	
	// Добавить стоимость от РЕПО
	                                 
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.Организация КАК Организация,
	|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК АктивСтраховойКомпании,
	|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
	|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
	|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
	|	0 КАК ДисконтПремияНачисленныйОстаток,
	|	0 КАК КорректировкаЭСПОстаток,
	|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК СтоимостьПокупкиОстаток,
	|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупонаОстаток,
	|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупонаОстаток,
	|	&ВалютаАктива КАК Валюта
	|ПОМЕСТИТЬ _ОстаткиЦенныхБумаг
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ЦеннаяБумага = &АктивСтраховойКомпании) КАК БухПартииЦенныхБумагОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ОстаткиЦенныхБумаг.АктивСтраховойКомпании КАК АктивСтраховойКомпании,
	|	(ВЫБОР
	|		КОГДА &ДоходыВСтоимости
	|			ТОГДА _ОстаткиЦенныхБумаг.СтоимостьОстаток + _ОстаткиЦенныхБумаг.ПереоценкаОстаток + _ОстаткиЦенныхБумаг.ДисконтПремияНачисленныйОстаток + _ОстаткиЦенныхБумаг.КорректировкаЭСПОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА _ОстаткиЦенныхБумаг.ДисконтПремияНачисленныйОстаток < 0
	|					ТОГДА _ОстаткиЦенныхБумаг.СтоимостьОстаток + _ОстаткиЦенныхБумаг.ПереоценкаОстаток
	|				ИНАЧЕ _ОстаткиЦенныхБумаг.СтоимостьПокупкиОстаток + _ОстаткиЦенныхБумаг.ПереоценкаОстаток
	|			КОНЕЦ
	|	КОНЕЦ + _ОстаткиЦенныхБумаг.СтоимостьКупонаОстаток + _ОстаткиЦенныхБумаг.ПереоценкаКупонаОстаток) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК БалансоваяСтоимость,
	|	КурсыВалютСрезПоследних.Период КАК ДатаКурсаВалют
	|ИЗ
	|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаВалютногоКурса, ) КАК КурсыВалютСрезПоследних
	|		ПО _ОстаткиЦенныхБумаг.Валюта = КурсыВалютСрезПоследних.Валюта"; 			
	
	Запрос.УстановитьПараметр("АктивСтраховойКомпании", АктивСтраховойКомпании);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаВалютногоКурса", ДатаВалютногоКурса);
	Запрос.УстановитьПараметр("Период", Период);  
	Запрос.УстановитьПараметр("ВалютаАктива", ВалютаАктива); 	
	Запрос.УстановитьПараметр("ДоходыВСтоимости", ДоходыВСтоимости);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Если РезультатЗапроса.Следующий() Тогда
		Результат["БалансоваяСтоимостьРЕПО"] = РезультатЗапроса.БалансоваяСтоимость;
	КонецЕсли;       	
	
	Возврат Результат;
  	 
	
КонецФункции
